wine-pair-app/app/controllers/redwines_controller.rb

SELECT "redwines".* FROM "redwines"
---
  def index
    @redwines = Redwine.all

SELECT  "redwines".* FROM "redwines" WHERE "redwines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @redwine = Redwine.find params[:id]

SELECT  "redwines".* FROM "redwines" WHERE "redwines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_redwine
      @redwine = Redwine.find(params[:id])