wine-pair-app/app/controllers/whitewines_controller.rb

SELECT "whitewines".* FROM "whitewines"
---
  def index
    @whitewines = Whitewine.all

SELECT  "whitewines".* FROM "whitewines" WHERE "whitewines"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    puts 'here'
    @whitewine = Whitewine.find params[:id]

SELECT  "whitewines".* FROM "whitewines" WHERE "whitewines"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_whitewine
      @whitewine = Whitewine.find(params[:id])