wine-pair-app/app/controllers/wineingred_controller.rb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "wineingreds".* FROM "wineingreds" WHERE "wineingreds"."ingredient_id" = $1 ORDER BY "wineingreds"."id" ASC LIMIT $2  [["ingredient_id", 3], ["LIMIT", 1]]
SELECT "redwines".* FROM "redwines" WHERE "redwines"."id" = $1  [["id", 8]]
SELECT "wineingreds".* FROM "wineingreds" WHERE "wineingreds"."ingredient_id" = $1  [["ingredient_id", 3]]
---
    def index
      @ingredient = Ingredient.find(params[:ingredient_id])
      @wineingreds = Wineingred.where(ingredient_id:@ingredient.id)

      @red = Redwine.where(id:@wineingreds[0].redwine_id)